src/cfe/DataProcessors/кбп_КонструкторСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>кбп_КонструкторСхем</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/Enums/кбп_СобытияЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_СобытияЗапуска</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/DataProcessors/кбп_КонструкторСхем/Forms/ПравилаЗапуска/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Схема = Параметры.Схема;
	Если Не ЗначениеЗаполнено(Схема) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Выберите схему в конструкторе.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Заголовок = СтрШаблон(НСтр("ru = 'Правила запуска: %1'"), Схема);
	ТипПредмета = Схема.ТипПредмета;
	Если ЗначениеЗаполнено(ТипПредмета) Тогда
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ТипПредмета);
		ТипПредметаПредставление = ?(ОбъектМетаданных = Неопределено, ТипПредмета, ОбъектМетаданных.Представление());
	Иначе
		ТипПредметаПредставление = НСтр("ru = 'не задан — доступен только запуск по расписанию'");
	КонецЕсли;
	ЗапретВторогоЭкземпляра = Схема.ЗапретВторогоЭкземпляра;

	Для Каждого Правило Из Схема.ПравилаЗапуска Цикл
		СтрокаПравила = Правила.Добавить();
		СтрокаПравила.Событие = Правило.Событие;
		СтрокаПравила.Активно = Правило.Активно;
		УстановитьУсловие(СтрокаПравила, Правило.Условие.Получить());
		УстановитьРасписание(СтрокаПравила, Правило.Расписание.Получить());
	КонецЦикла;
	Для Каждого Исключение Из Схема.ИсключенияЗапуска Цикл
		ЗаполнитьЗначенияСвойств(Исключения.Добавить(), Исключение);
	КонецЦикла;

	// Без предмета правила «при записи» и «при проведении» не имеют смысла.
	Если Не ЗначениеЗаполнено(ТипПредмета) Тогда
		Элементы.ПравилаСобытие.СписокВыбора.Добавить(Перечисления.кбп_СобытияЗапуска.Расписание);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПравила

&НаКлиенте
Процедура ПравилаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.ПравилаТекстУсловия Тогда
		СтандартнаяОбработка = Ложь;
		УсловиеПравила(Неопределено);
	ИначеЕсли Поле = Элементы.ПравилаТекстРасписания Тогда
		СтандартнаяОбработка = Ложь;
		РасписаниеПравила(Неопределено);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	ЗаписатьНаСервере();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Правила запуска записаны'"));
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура УсловиеПравила(Команда)

	ТекущиеДанные = Элементы.Правила.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите правило в таблице.'"));
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Схема", Схема);
	ПараметрыФормы.Вставить("АдресНастроек", ТекущиеДанные.АдресУсловия);
	ПараметрыФормы.Вставить("ИдентификаторВладельца", УникальныйИдентификатор);
	ПараметрыФормы.Вставить("ЗаголовокФормы", СтрШаблон(НСтр("ru = 'Условие запуска: %1'"), ТекущиеДанные.Событие));
	ОткрытьФорму("Обработка.кбп_КонструкторСхем.Форма.УсловиеПерехода", ПараметрыФормы, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("УсловиеПравилаЗавершение", ЭтотОбъект, ТекущиеДанные.ПолучитьИдентификатор()),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура РасписаниеПравила(Команда)

	ТекущиеДанные = Элементы.Правила.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите правило в таблице.'"));
		Возврат;
	КонецЕсли;
	Расписание = Неопределено;
	Если ЗначениеЗаполнено(ТекущиеДанные.АдресРасписания) Тогда
		Расписание = ПолучитьИзВременногоХранилища(ТекущиеДанные.АдресРасписания);
	КонецЕсли;
	Если ТипЗнч(Расписание) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		Расписание = Новый РасписаниеРегламентногоЗадания;
		Расписание.ПериодПовтораДней = 1;
	КонецЕсли;
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Диалог.Показать(Новый ОписаниеОповещения("РасписаниеПравилаЗавершение", ЭтотОбъект,
		ТекущиеДанные.ПолучитьИдентификатор()));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УсловиеПравилаЗавершение(АдресНастроек, Идентификатор) Экспорт

	Если ТипЗнч(АдресНастроек) <> Тип("Строка") Или Не ЗначениеЗаполнено(АдресНастроек) Тогда
		Возврат;
	КонецЕсли;
	ПрименитьУсловие(Идентификатор, АдресНастроек);

КонецПроцедуры

&НаКлиенте
Процедура РасписаниеПравилаЗавершение(Расписание, Идентификатор) Экспорт

	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаПравила = Правила.НайтиПоИдентификатору(Идентификатор);
	Если СтрокаПравила = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаПравила.АдресРасписания = ПоместитьВоВременноеХранилище(Расписание, УникальныйИдентификатор);
	СтрокаПравила.ТекстРасписания = Строка(Расписание);
	СтрокаПравила.Событие = ПредопределенноеЗначение("Перечисление.кбп_СобытияЗапуска.Расписание");
	СтрокаПравила.Активно = Истина;

КонецПроцедуры

&НаСервере
Процедура ПрименитьУсловие(Идентификатор, АдресНастроек)

	СтрокаПравила = Правила.НайтиПоИдентификатору(Идентификатор);
	Если СтрокаПравила <> Неопределено Тогда
		УстановитьУсловие(СтрокаПравила, ПолучитьИзВременногоХранилища(АдресНастроек));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловие(СтрокаПравила, Настройки)

	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		СтрокаПравила.АдресУсловия = ПоместитьВоВременноеХранилище(Настройки, УникальныйИдентификатор);
		СтрокаПравила.ТекстУсловия = кбп_Условия.ПредставлениеУсловия(Настройки);
	Иначе
		СтрокаПравила.АдресУсловия = "";
		СтрокаПравила.ТекстУсловия = "";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтрокаПравила.ТекстУсловия) Тогда
		СтрокаПравила.ТекстУсловия = НСтр("ru = 'всегда'");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьРасписание(СтрокаПравила, Расписание)

	Если ТипЗнч(Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
		СтрокаПравила.АдресРасписания = ПоместитьВоВременноеХранилище(Расписание, УникальныйИдентификатор);
		СтрокаПравила.ТекстРасписания = Строка(Расписание);
	Иначе
		СтрокаПравила.АдресРасписания = "";
		СтрокаПравила.ТекстРасписания = "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	СхемаОбъект = Схема.ПолучитьОбъект();
	СхемаОбъект.ЗапретВторогоЭкземпляра = ЗапретВторогоЭкземпляра;
	СхемаОбъект.ПравилаЗапуска.Очистить();
	Для Каждого СтрокаПравила Из Правила Цикл
		Если Не ЗначениеЗаполнено(СтрокаПравила.Событие) Тогда
			Продолжить;
		КонецЕсли;
		Правило = СхемаОбъект.ПравилаЗапуска.Добавить();
		Правило.Событие = СтрокаПравила.Событие;
		Правило.Активно = СтрокаПравила.Активно;
		Правило.Условие = Новый ХранилищеЗначения(ЗначениеИзХранилища(СтрокаПравила.АдресУсловия));
		Правило.Расписание = Новый ХранилищеЗначения(ЗначениеИзХранилища(СтрокаПравила.АдресРасписания));
	КонецЦикла;
	СхемаОбъект.ИсключенияЗапуска.Очистить();
	Для Каждого СтрокаПравила Из Исключения Цикл
		Если ЗначениеЗаполнено(СтрокаПравила.Значение) Тогда
			ЗаполнитьЗначенияСвойств(СхемаОбъект.ИсключенияЗапуска.Добавить(), СтрокаПравила);
		КонецЕсли;
	КонецЦикла;
	СхемаОбъект.Записать();
	кбп_ПроцессыСлужебный.ОбновитьПравилаЗапуска(Схема);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеИзХранилища(Адрес)
	Возврат ?(ЭтоАдресВременногоХранилища(Адрес), ПолучитьИзВременногоХранилища(Адрес), Неопределено);
КонецФункции

#КонецОбласти
